jantielens/esp32-template-wifi/src/app/device_telemetry.cpp
#include "device_telemetry.h"

#include "log_manager.h"
#include "board_config.h"
#include "fs_health.h"

#include <Arduino.h>
#include <WiFi.h>
#include "soc/soc_caps.h"
#include <esp_heap_caps.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/timers.h>

#if HAS_MQTT
#include "mqtt_manager.h"
#endif

#if HAS_DISPLAY
#include "display_manager.h"
#endif

// Temperature sensor support (ESP32-C3, ESP32-S2, ESP32-S3, ESP32-C2, ESP32-C6, ESP32-H2)
#if SOC_TEMP_SENSOR_SUPPORTED
#include "driver/temperature_sensor.h"
#endif

// CPU usage tracking (task-based)
static SemaphoreHandle_t cpu_mutex = nullptr;
static int cpu_usage_current = -1;
static TaskHandle_t cpu_task_handle = nullptr;

// Delta tracking for calculation
static uint32_t last_idle_runtime = 0;
static uint32_t last_total_runtime = 0;
static bool first_calculation = true;

static bool log_every_ms(unsigned long now_ms, unsigned long *last_ms, unsigned long interval_ms) {
    if (!last_ms) return false;
    if (*last_ms == 0 || (now_ms - *last_ms) >= interval_ms) {
        *last_ms = now_ms;
        return true;
    }
    return false;
}

// /api/health min/max window sampling (reset on /api/health).
// Goal: capture short-lived dips/spikes between HTTP polls without storing
// time series on-device.
static portMUX_TYPE g_health_window_mux = portMUX_INITIALIZER_UNLOCKED;
static TimerHandle_t g_health_window_timer = nullptr;

static constexpr uint32_t kHealthWindowSamplePeriodMs = 200;

struct HealthWindowStats {
    bool initialized;

    size_t internal_free_min;
    size_t internal_free_max;
    size_t internal_largest_min;
    int internal_frag_max;

    size_t psram_free_min;
    size_t psram_free_max;
    size_t psram_largest_min;
    int psram_frag_max;
};

static HealthWindowStats g_health_window = {
    /*initialized*/ false,
    /*internal_free_min*/ 0,
    /*internal_free_max*/ 0,
    /*internal_largest_min*/ 0,
    /*internal_frag_max*/ 0,
    /*psram_free_min*/ 0,
    /*psram_free_max*/ 0,
    /*psram_largest_min*/ 0,
    /*psram_frag_max*/ 0,
};

static void health_window_reset() {
    portENTER_CRITICAL(&g_health_window_mux);
    g_health_window = {};
    g_health_window.initialized = false;
    portEXIT_CRITICAL(&g_health_window_mux);
}

static int compute_fragmentation_percent(size_t free_bytes, size_t largest_bytes) {
    if (free_bytes == 0) return 0;
    if (largest_bytes > free_bytes) return 0;
    float frag = (1.0f - ((float)largest_bytes / (float)free_bytes)) * 100.0f;
    if (frag < 0) frag = 0;
    if (frag > 100) frag = 100;
    return (int)frag;
}

static void health_window_update_sample(size_t internal_free, size_t internal_largest, size_t psram_free, size_t psram_largest) {
    const int internal_frag = compute_fragmentation_percent(internal_free, internal_largest);
    const int psram_frag = compute_fragmentation_percent(psram_free, psram_largest);

    portENTER_CRITICAL(&g_health_window_mux);

    if (!g_health_window.initialized) {
        g_health_window.initialized = true;

        g_health_window.internal_free_min = internal_free;
        g_health_window.internal_free_max = internal_free;
        g_health_window.internal_largest_min = internal_largest;
        g_health_window.internal_frag_max = internal_frag;

        g_health_window.psram_free_min = psram_free;
        g_health_window.psram_free_max = psram_free;
        g_health_window.psram_largest_min = psram_largest;
        g_health_window.psram_frag_max = psram_frag;

        portEXIT_CRITICAL(&g_health_window_mux);
        return;
    }

    if (internal_free < g_health_window.internal_free_min) g_health_window.internal_free_min = internal_free;
    if (internal_free > g_health_window.internal_free_max) g_health_window.internal_free_max = internal_free;
    if (internal_largest < g_health_window.internal_largest_min) g_health_window.internal_largest_min = internal_largest;
    if (internal_frag > g_health_window.internal_frag_max) g_health_window.internal_frag_max = internal_frag;

    if (psram_free < g_health_window.psram_free_min) g_health_window.psram_free_min = psram_free;
    if (psram_free > g_health_window.psram_free_max) g_health_window.psram_free_max = psram_free;
    if (psram_largest < g_health_window.psram_largest_min) g_health_window.psram_largest_min = psram_largest;
    if (psram_frag > g_health_window.psram_frag_max) g_health_window.psram_frag_max = psram_frag;

    portEXIT_CRITICAL(&g_health_window_mux);
}

// Flash/sketch metadata caching (avoid re-entrant ESP-IDF image/mmap helpers)
static bool flash_cache_initialized = false;
static size_t cached_sketch_size = 0;
static size_t cached_free_sketch_space = 0;

static void fill_common(JsonDocument &doc, bool include_ip_and_channel, bool include_debug_fields);

static void fill_health_window_fields_and_reset(JsonDocument &doc);

static void get_memory_snapshot(
    size_t *out_heap_free,
    size_t *out_heap_min,
    size_t *out_heap_largest,
    size_t *out_internal_free,
    size_t *out_internal_min,
    size_t *out_psram_free,
    size_t *out_psram_min,
    size_t *out_psram_largest
);

static int calculate_cpu_usage() {
    // IMPORTANT:
    // - uxTaskGetSystemState returns 0 when the provided array is too small.
    // - TaskStatus_t is fairly large; keep this out of stack (CPU monitor task stack is small).
    // - If runtime stats aren't enabled, total_runtime and ulRunTimeCounter stay 0 -> treat as unknown.
    constexpr UBaseType_t kMaxTasks = 24;
    static TaskStatus_t task_stats[kMaxTasks];

    // Guard: if there are more tasks than we can sample, bail out and log.
    // This keeps the static array size fixed (no extra RAM), while making truncation visible.
    static unsigned long last_truncation_log_ms = 0;
    const unsigned long now_ms = millis();
    const UBaseType_t expected_tasks = uxTaskGetNumberOfTasks();
    if (expected_tasks > kMaxTasks) {
        if (log_every_ms(now_ms, &last_truncation_log_ms, 5000)) {
            Logger.logQuickf(
                "CPU",
                "Runtime stats truncated: tasks=%u > max=%u (cpu_usage unavailable)",
                (unsigned)expected_tasks,
                (unsigned)kMaxTasks
            );
        }
        return -1;
    }

    uint32_t total_runtime = 0;
    const int task_count = uxTaskGetSystemState(task_stats, kMaxTasks, &total_runtime);

    static unsigned long last_runtime_stats_log_ms = 0;
    if (task_count <= 0 || total_runtime == 0) {
        if (log_every_ms(now_ms, &last_runtime_stats_log_ms, 5000)) {
            Logger.logQuickf(
                "CPU",
                "Runtime stats unavailable: uxTaskGetSystemState=%d total_runtime=%lu",
                task_count,
                (unsigned long)total_runtime
            );
        }
        return -1;
    }

    // Count IDLE tasks and sum their runtimes.
    uint32_t idle_runtime = 0;
    int idle_task_count = 0;
    for (UBaseType_t i = 0; i < task_count; i++) {
        const char* name = task_stats[i].pcTaskName;
        if (name && strstr(name, "IDLE") != nullptr) {
            idle_runtime += task_stats[i].ulRunTimeCounter;
            idle_task_count++;
        }
    }

    if (idle_task_count <= 0) return -1;

