jantielens/esp32-template-wifi/src/app/device_telemetry.cpp
    // Skip first calculation (need delta)
    if (first_calculation) {
        last_idle_runtime = idle_runtime;
        last_total_runtime = total_runtime;
        first_calculation = false;
        return -1;
    }

    // Calculate delta.
    const uint32_t idle_delta = idle_runtime - last_idle_runtime;
    const uint32_t total_delta = total_runtime - last_total_runtime;

    last_idle_runtime = idle_runtime;
    last_total_runtime = total_runtime;

    if (total_delta == 0) return -1;

    const uint32_t max_idle_time = total_delta * (uint32_t)idle_task_count;
    if (max_idle_time == 0) return -1;

    const float idle_percent = ((float)idle_delta / (float)max_idle_time) * 100.0f;
    int cpu_usage = (int)(100.0f - idle_percent);

    if (cpu_usage < 0) cpu_usage = 0;
    if (cpu_usage > 100) cpu_usage = 100;

    return cpu_usage;
}

static void health_window_timer_cb(TimerHandle_t) {
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    // heap_largest is computed as INTERNAL largest free block (see get_memory_snapshot).
    health_window_update_sample(internal_free, heap_largest, psram_free, psram_largest);
}

static HealthWindowStats health_window_get_and_reset(size_t internal_free_now, size_t internal_largest_now, size_t psram_free_now, size_t psram_largest_now) {
    const int internal_frag_now = compute_fragmentation_percent(internal_free_now, internal_largest_now);
    const int psram_frag_now = compute_fragmentation_percent(psram_free_now, psram_largest_now);

    HealthWindowStats snap;

    portENTER_CRITICAL(&g_health_window_mux);

    // Ensure the current point-in-time values are included in the window we return.
    if (!g_health_window.initialized) {
        g_health_window.initialized = true;
        g_health_window.internal_free_min = internal_free_now;
        g_health_window.internal_free_max = internal_free_now;
        g_health_window.internal_largest_min = internal_largest_now;
        g_health_window.internal_frag_max = internal_frag_now;
        g_health_window.psram_free_min = psram_free_now;
        g_health_window.psram_free_max = psram_free_now;
        g_health_window.psram_largest_min = psram_largest_now;
        g_health_window.psram_frag_max = psram_frag_now;
    } else {
        if (internal_free_now < g_health_window.internal_free_min) g_health_window.internal_free_min = internal_free_now;
        if (internal_free_now > g_health_window.internal_free_max) g_health_window.internal_free_max = internal_free_now;
        if (internal_largest_now < g_health_window.internal_largest_min) g_health_window.internal_largest_min = internal_largest_now;
        if (internal_frag_now > g_health_window.internal_frag_max) g_health_window.internal_frag_max = internal_frag_now;

        if (psram_free_now < g_health_window.psram_free_min) g_health_window.psram_free_min = psram_free_now;
        if (psram_free_now > g_health_window.psram_free_max) g_health_window.psram_free_max = psram_free_now;
        if (psram_largest_now < g_health_window.psram_largest_min) g_health_window.psram_largest_min = psram_largest_now;
        if (psram_frag_now > g_health_window.psram_frag_max) g_health_window.psram_frag_max = psram_frag_now;
    }

    snap = g_health_window;

    // Reset the window and immediately seed the next window with the current values.
    g_health_window = {};
    g_health_window.initialized = true;
    g_health_window.internal_free_min = internal_free_now;
    g_health_window.internal_free_max = internal_free_now;
    g_health_window.internal_largest_min = internal_largest_now;
    g_health_window.internal_frag_max = internal_frag_now;
    g_health_window.psram_free_min = psram_free_now;
    g_health_window.psram_free_max = psram_free_now;
    g_health_window.psram_largest_min = psram_largest_now;
    g_health_window.psram_frag_max = psram_frag_now;

    portEXIT_CRITICAL(&g_health_window_mux);
    return snap;
}

static void log_task_stack_watermarks_one_shot() {
    const UBaseType_t task_count = uxTaskGetNumberOfTasks();
    if (task_count == 0) return;

    TaskStatus_t* tasks = nullptr;
    if (psramFound()) {
        tasks = (TaskStatus_t*)heap_caps_malloc(sizeof(TaskStatus_t) * task_count, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    if (!tasks) {
        tasks = (TaskStatus_t*)heap_caps_malloc(sizeof(TaskStatus_t) * task_count, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (!tasks) {
        Logger.logMessage("Mem", "TRIPWIRE: OOM while allocating task list");
        return;
    }

    uint32_t total_runtime = 0;
    const UBaseType_t got = uxTaskGetSystemState(tasks, task_count, &total_runtime);
    if (got == 0) {
        heap_caps_free(tasks);
        Logger.logMessage("Mem", "TRIPWIRE: uxTaskGetSystemState returned 0");
        return;
    }

    // Sort by lowest high-water mark first (most at risk).
    for (UBaseType_t i = 0; i < got; i++) {
        UBaseType_t best = i;
        for (UBaseType_t j = i + 1; j < got; j++) {
            if (tasks[j].usStackHighWaterMark < tasks[best].usStackHighWaterMark) {
                best = j;
            }
        }
        if (best != i) {
            TaskStatus_t tmp = tasks[i];
            tasks[i] = tasks[best];
            tasks[best] = tmp;
        }
    }

    // Keep logs bounded.
    const UBaseType_t max_to_log = (got > 16) ? 16 : got;
    Logger.logMessagef("Mem", "TRIPWIRE: task stack watermarks (worst %u/%u)", (unsigned)max_to_log, (unsigned)got);
    for (UBaseType_t i = 0; i < max_to_log; i++) {
        const unsigned bytes = (unsigned)tasks[i].usStackHighWaterMark * (unsigned)sizeof(StackType_t);
        Logger.logMessagef("Stack", "%s hw=%u", tasks[i].pcTaskName ? tasks[i].pcTaskName : "(null)", bytes);
    }

    heap_caps_free(tasks);
}

DeviceMemorySnapshot device_telemetry_get_memory_snapshot() {
    DeviceMemorySnapshot snapshot = {};

    get_memory_snapshot(
        &snapshot.heap_free_bytes,
        &snapshot.heap_min_free_bytes,
        &snapshot.heap_largest_free_block_bytes,
        &snapshot.heap_internal_free_bytes,
        &snapshot.heap_internal_min_free_bytes,
        &snapshot.psram_free_bytes,
        &snapshot.psram_min_free_bytes,
        &snapshot.psram_largest_free_block_bytes
    );

    return snapshot;
}

