jantielens/esp32-template-wifi/src/app/device_telemetry.cpp
void device_telemetry_log_memory_snapshot(const char *tag) {
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    // Keep this line short to avoid LogManager's internal fixed buffers truncating the output.
    // Keys:
    // hf=heap_free hm=heap_min hl=heap_largest hi=internal_free hin=internal_min
    // pf=psram_free pm=psram_min pl=psram_largest
    // frag=heap fragmentation percent (based on hl/hf)

    unsigned frag_percent = 0;
    if (heap_free > 0) {
        float fragmentation = (1.0f - ((float)heap_largest / (float)heap_free)) * 100.0f;
        if (fragmentation < 0) fragmentation = 0;
        if (fragmentation > 100) fragmentation = 100;
        frag_percent = (unsigned)fragmentation;
    }

    Logger.logMessagef(
        "Mem",
        "%s hf=%u hm=%u hl=%u hi=%u hin=%u frag=%u pf=%u pm=%u pl=%u",
        tag ? tag : "(null)",
        (unsigned)heap_free,
        (unsigned)heap_min,
        (unsigned)heap_largest,
        (unsigned)internal_free,
        (unsigned)internal_min,
        (unsigned)frag_percent,
        (unsigned)psram_free,
        (unsigned)psram_min,
        (unsigned)psram_largest
    );
}

void device_telemetry_check_tripwires() {
    #if MEMORY_TRIPWIRE_INTERNAL_MIN_BYTES == 0
    return;
    #else
    static bool fired = false;
    static unsigned long last_check = 0;

    if (fired) return;

    const unsigned long now = millis();
    if (last_check != 0 && (now - last_check) < (unsigned long)MEMORY_TRIPWIRE_CHECK_INTERVAL_MS) {
        return;
    }
    last_check = now;

    DeviceMemorySnapshot snapshot = device_telemetry_get_memory_snapshot();
    if (snapshot.heap_internal_min_free_bytes > (size_t)MEMORY_TRIPWIRE_INTERNAL_MIN_BYTES) {
        return;
    }

    fired = true;
    Logger.logMessagef(
        "Mem",
        "TRIPWIRE fired: internal_min=%u <= %u",
        (unsigned)snapshot.heap_internal_min_free_bytes,
        (unsigned)MEMORY_TRIPWIRE_INTERNAL_MIN_BYTES
    );
    log_task_stack_watermarks_one_shot();
    #endif
}

void device_telemetry_fill_api(JsonDocument &doc) {
    fill_common(doc, true, true);

    // Min/max fields sampled between /api/health polls.
    // Semantics (per PR #30): the returned window includes the current point-in-time
    // values, and after each response the next window is reset and immediately
    // seeded with the current values.
    fill_health_window_fields_and_reset(doc);

    // =====================================================================
    // USER-EXTEND: Add your own sensors to the web "health" API (/api/health)
    // =====================================================================
    // If you want your external sensors to show up in the web portal health widget,
    // add fields here.
    //
    // IMPORTANT:
    // - The key "cpu_temperature" is used for the SoC/internal temperature.
    //   You can safely use "temperature" for an external/ambient sensor.
    // - If you also publish these over MQTT, keep the JSON keys identical in
    //   device_telemetry_fill_mqtt() so you can reuse the same HA templates.
    //
    // Example (commented out):
    // doc["temperature"] = 23.4;
    // doc["humidity"] = 55.2;
}

void device_telemetry_fill_mqtt(JsonDocument &doc) {
    fill_common(doc, false, false);

    // =====================================================================
    // USER-EXTEND: Add your own sensors to the MQTT state payload
    // =====================================================================
    // The MQTT integration publishes ONE batched JSON document (retained) to:
    //   devices/<sanitized>/health/state
    // Home Assistant entities then extract values via value_template, e.g.:
    //   {{ value_json.temperature }}
    //
    // Add your custom sensor fields below.
    //
    // IMPORTANT:
    // - The key "cpu_temperature" is used for the SoC/internal temperature.
    //   You can safely use "temperature" for an external/ambient sensor.
    //
    // Example (commented out):
    // doc["temperature"] = 23.4;
    // doc["humidity"] = 55.2;
}

void device_telemetry_init() {
    if (flash_cache_initialized) return;

    cached_sketch_size = ESP.getSketchSize();
    cached_free_sketch_space = ESP.getFreeSketchSpace();
    flash_cache_initialized = true;
}

size_t device_telemetry_sketch_size() {
    if (!flash_cache_initialized) {
        device_telemetry_init();
    }
    return cached_sketch_size;
}

size_t device_telemetry_free_sketch_space() {
    if (!flash_cache_initialized) {
        device_telemetry_init();
    }
    return cached_free_sketch_space;
}

// Background task: Calculate CPU usage every 1s.
static void cpu_monitoring_task(void* param) {
    while (true) {
        const int new_value = calculate_cpu_usage();

        xSemaphoreTake(cpu_mutex, portMAX_DELAY);
        cpu_usage_current = new_value;
        xSemaphoreGive(cpu_mutex);

        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

void device_telemetry_start_cpu_monitoring() {
    if (cpu_task_handle != nullptr) return;  // Already started
    
    cpu_mutex = xSemaphoreCreateMutex();
    if (cpu_mutex == nullptr) {
        Logger.logMessage("CPU Monitor", "Failed to create mutex");
        return;
    }
    
    BaseType_t result = xTaskCreate(
        cpu_monitoring_task,
        "cpu_monitor",
        2048,  // Stack size
        nullptr,
        1,  // Low priority
        &cpu_task_handle
    );
    
    if (result != pdPASS) {
        Logger.logMessage("CPU Monitor", "Failed to create task");
        vSemaphoreDelete(cpu_mutex);
        cpu_mutex = nullptr;
    }
}

int device_telemetry_get_cpu_usage() {
    if (cpu_mutex == nullptr) return -1;  // Not initialized

    int value = -1;
    xSemaphoreTake(cpu_mutex, portMAX_DELAY);
    value = cpu_usage_current;
    xSemaphoreGive(cpu_mutex);
    return value;
}

void device_telemetry_start_health_window_sampling() {
    if (g_health_window_timer != nullptr) return;

    health_window_reset();
    g_health_window_timer = xTimerCreate(
        "health_win",
        pdMS_TO_TICKS(kHealthWindowSamplePeriodMs),
        pdTRUE,
        nullptr,
        health_window_timer_cb
    );

    if (!g_health_window_timer) {
        Logger.logMessage("Health", "Failed to create health window timer");
        return;
    }

    if (xTimerStart(g_health_window_timer, 0) != pdPASS) {
        Logger.logMessage("Health", "Failed to start health window timer");
        xTimerDelete(g_health_window_timer, 0);
        g_health_window_timer = nullptr;
        return;
    }
}

static void fill_health_window_fields_and_reset(JsonDocument &doc) {
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    // heap_largest represents INTERNAL largest free block (see get_memory_snapshot).
    const HealthWindowStats win = health_window_get_and_reset(internal_free, heap_largest, psram_free, psram_largest);

