jantielens/esp32-template-wifi/src/app/device_telemetry.cpp
    doc["heap_internal_free_min_window"] = (uint32_t)win.internal_free_min;
    doc["heap_internal_free_max_window"] = (uint32_t)win.internal_free_max;
    doc["heap_internal_largest_min_window"] = (uint32_t)win.internal_largest_min;
    doc["heap_fragmentation_max_window"] = win.internal_frag_max;

    doc["psram_free_min_window"] = (uint32_t)win.psram_free_min;
    doc["psram_free_max_window"] = (uint32_t)win.psram_free_max;
    doc["psram_largest_min_window"] = (uint32_t)win.psram_largest_min;
    doc["psram_fragmentation_max_window"] = win.psram_frag_max;
}

static void fill_common(JsonDocument &doc, bool include_ip_and_channel, bool include_debug_fields) {
    // System
    uint64_t uptime_us = esp_timer_get_time();
    doc["uptime_seconds"] = uptime_us / 1000000;

    // Reset reason
    esp_reset_reason_t reset_reason = esp_reset_reason();
    const char* reset_str = "Unknown";
    switch (reset_reason) {
        case ESP_RST_POWERON:   reset_str = "Power On"; break;
        case ESP_RST_SW:        reset_str = "Software"; break;
        case ESP_RST_PANIC:     reset_str = "Panic"; break;
        case ESP_RST_INT_WDT:   reset_str = "Interrupt WDT"; break;
        case ESP_RST_TASK_WDT:  reset_str = "Task WDT"; break;
        case ESP_RST_WDT:       reset_str = "WDT"; break;
        case ESP_RST_DEEPSLEEP: reset_str = "Deep Sleep"; break;
        case ESP_RST_BROWNOUT:  reset_str = "Brownout"; break;
        case ESP_RST_SDIO:      reset_str = "SDIO"; break;
        default: break;
    }
    doc["reset_reason"] = reset_str;

    // CPU (API includes cpu_freq; MQTT keeps payload smaller)
    if (include_debug_fields) {
        doc["cpu_freq"] = ESP.getCpuFreqMHz();
    }

    // CPU usage (nullable when runtime stats are unavailable)
    const int cpu_usage = device_telemetry_get_cpu_usage();
    if (cpu_usage < 0) {
        doc["cpu_usage"] = nullptr;
    } else {
        doc["cpu_usage"] = cpu_usage;
    }

    // CPU / SoC temperature
#if SOC_TEMP_SENSOR_SUPPORTED
    float temp_celsius = 0;
    temperature_sensor_handle_t temp_sensor = NULL;
    temperature_sensor_config_t temp_sensor_config = TEMPERATURE_SENSOR_CONFIG_DEFAULT(-10, 80);

    if (temperature_sensor_install(&temp_sensor_config, &temp_sensor) == ESP_OK) {
        if (temperature_sensor_enable(temp_sensor) == ESP_OK) {
            if (temperature_sensor_get_celsius(temp_sensor, &temp_celsius) == ESP_OK) {
                doc["cpu_temperature"] = (int)temp_celsius;
            } else {
                doc["cpu_temperature"] = nullptr;
            }
            temperature_sensor_disable(temp_sensor);
        } else {
            doc["cpu_temperature"] = nullptr;
        }
        temperature_sensor_uninstall(temp_sensor);
    } else {
        doc["cpu_temperature"] = nullptr;
    }
#else
    doc["cpu_temperature"] = nullptr;
#endif

    // Memory
    size_t heap_free = 0;
    size_t heap_min = 0;
    size_t heap_largest = 0;
    size_t internal_free = 0;
    size_t internal_min = 0;
    size_t psram_free = 0;
    size_t psram_min = 0;
    size_t psram_largest = 0;

    get_memory_snapshot(
        &heap_free,
        &heap_min,
        &heap_largest,
        &internal_free,
        &internal_min,
        &psram_free,
        &psram_min,
        &psram_largest
    );

    doc["heap_free"] = heap_free;
    doc["heap_min"] = heap_min;
    if (include_debug_fields) {
        doc["heap_size"] = ESP.getHeapSize();
    }

    // Additional heap/PSRAM details (useful for memory/fragmentation investigations)
    doc["heap_largest"] = heap_largest;
    doc["heap_internal_free"] = internal_free;
    doc["heap_internal_min"] = internal_min;
    const size_t internal_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    doc["heap_internal_largest"] = internal_largest;
    doc["psram_free"] = psram_free;
    doc["psram_min"] = psram_min;
    doc["psram_largest"] = psram_largest;

    // Heap fragmentation
    // IMPORTANT: On PSRAM boards, `heap_caps_get_largest_free_block(MALLOC_CAP_8BIT)` can return a PSRAM block,
    // while `ESP.getFreeHeap()` reports internal heap only. Mixing those yields negative fragmentation.
    // We define heap fragmentation as INTERNAL heap fragmentation.
    float heap_frag = 0;
    if (internal_free > 0 && internal_largest <= internal_free) {
        heap_frag = (1.0f - ((float)internal_largest / (float)internal_free)) * 100.0f;
    }
    if (heap_frag < 0) heap_frag = 0;
    if (heap_frag > 100) heap_frag = 100;
    doc["heap_fragmentation"] = (int)heap_frag;

    float psram_frag = 0;
    if (psram_free > 0 && psram_largest <= psram_free) {
        psram_frag = (1.0f - ((float)psram_largest / (float)psram_free)) * 100.0f;
    }
    if (psram_frag < 0) psram_frag = 0;
    if (psram_frag > 100) psram_frag = 100;
    doc["psram_fragmentation"] = (int)psram_frag;

    // Flash usage
    const size_t sketch_size = device_telemetry_sketch_size();
    const size_t free_sketch_space = device_telemetry_free_sketch_space();
    doc["flash_used"] = sketch_size;
    doc["flash_total"] = sketch_size + free_sketch_space;

    // Filesystem health (cached; may be absent or not mounted)
    {
        FSHealthStats fs;
        fs_health_get(&fs);

        if (!fs.ffat_partition_present) {
            doc["fs_mounted"] = nullptr;
            doc["fs_used_bytes"] = nullptr;
            doc["fs_total_bytes"] = nullptr;
        } else {
            doc["fs_mounted"] = fs.ffat_mounted ? true : false;
            if (fs.ffat_mounted && fs.ffat_total_bytes > 0) {
                doc["fs_used_bytes"] = (uint64_t)fs.ffat_used_bytes;
                doc["fs_total_bytes"] = (uint64_t)fs.ffat_total_bytes;
            } else {
                doc["fs_used_bytes"] = nullptr;
                doc["fs_total_bytes"] = nullptr;
            }
        }
    }

    // MQTT health (self-report)
    #if HAS_MQTT
    {
        doc["mqtt_enabled"] = mqtt_manager.enabled() ? true : false;
        doc["mqtt_publish_enabled"] = mqtt_manager.publishEnabled() ? true : false;
        doc["mqtt_connected"] = mqtt_manager.connected() ? true : false;

        const unsigned long last_pub = mqtt_manager.lastHealthPublishMs();
        if (last_pub == 0) {
            doc["mqtt_last_health_publish_ms"] = nullptr;
            doc["mqtt_health_publish_age_ms"] = nullptr;
        } else {
            doc["mqtt_last_health_publish_ms"] = last_pub;
            doc["mqtt_health_publish_age_ms"] = (unsigned long)(millis() - last_pub);
        }
    }
    #else
    doc["mqtt_enabled"] = false;
    doc["mqtt_publish_enabled"] = false;
    doc["mqtt_connected"] = false;
    doc["mqtt_last_health_publish_ms"] = nullptr;
    doc["mqtt_health_publish_age_ms"] = nullptr;
    #endif

    // Display perf (best-effort)
    #if HAS_DISPLAY
    if (displayManager) {
        DisplayPerfStats stats;
        if (display_manager_get_perf_stats(&stats)) {
            doc["display_fps"] = stats.fps;
            doc["display_lv_timer_us"] = stats.lv_timer_us;
            doc["display_present_us"] = stats.present_us;
        } else {
            doc["display_fps"] = nullptr;
            doc["display_lv_timer_us"] = nullptr;
            doc["display_present_us"] = nullptr;
        }
    } else {
        doc["display_fps"] = nullptr;
        doc["display_lv_timer_us"] = nullptr;
        doc["display_present_us"] = nullptr;
    }
    #else
    doc["display_fps"] = nullptr;
    doc["display_lv_timer_us"] = nullptr;
    doc["display_present_us"] = nullptr;
    #endif

    // WiFi stats (only if connected)
    if (WiFi.status() == WL_CONNECTED) {
        doc["wifi_rssi"] = WiFi.RSSI();

        if (include_ip_and_channel) {
            doc["wifi_channel"] = WiFi.channel();

            // Avoid heap churn in String::toString() by formatting into a fixed buffer.
            char ip_buf[16];
            snprintf(ip_buf, sizeof(ip_buf), "%u.%u.%u.%u", WiFi.localIP()[0], WiFi.localIP()[1], WiFi.localIP()[2], WiFi.localIP()[3]);
            doc["ip_address"] = ip_buf;

            doc["hostname"] = WiFi.getHostname();
        }
    } else {
        doc["wifi_rssi"] = nullptr;

        if (include_ip_and_channel) {
            doc["wifi_channel"] = nullptr;
            doc["ip_address"] = nullptr;
            doc["hostname"] = nullptr;
        }
    }
}

static void get_memory_snapshot(
    size_t *out_heap_free,
    size_t *out_heap_min,
    size_t *out_heap_largest,
    size_t *out_internal_free,
    size_t *out_internal_min,
    size_t *out_psram_free,
    size_t *out_psram_min,
    size_t *out_psram_largest
) {
    if (out_heap_free) *out_heap_free = ESP.getFreeHeap();
    if (out_heap_min) *out_heap_min = ESP.getMinFreeHeap();

    if (out_heap_largest) {
        // Keep this consistent with ESP.getFreeHeap() (internal heap): use INTERNAL 8-bit largest block.
        *out_heap_largest = heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }

    if (out_internal_free) {
        *out_internal_free = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }
    if (out_internal_min) {
        *out_internal_min = heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    }

#if SOC_SPIRAM_SUPPORTED
    if (out_psram_free) {
        *out_psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM);
    }
    if (out_psram_min) {
        *out_psram_min = heap_caps_get_minimum_free_size(MALLOC_CAP_SPIRAM);
    }
    if (out_psram_largest) {
        *out_psram_largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
    }
#else
    if (out_psram_free) *out_psram_free = 0;
    if (out_psram_min) *out_psram_min = 0;
    if (out_psram_largest) *out_psram_largest = 0;
#endif
}